
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       4 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                          |
|:--------:|:-------------------------------------------------------------------|
|    🟢     | `aws_iam_policy.jumphost-tester-permissions`                       |
|    🟢     | `aws_iam_role.jumphost-tester`                                     |
|    🟢     | `aws_iam_role_policy_attachment.jumphost-tester`                   |
|    🟢     | `aws_iam_role_policy_attachment.jumphost-tester-admin-permissions` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/11001594-4d8c-4ab5-b4a7-c3d609d7fa5d/terraform-bin plan -no-color --out=tf.plan
aws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]
aws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...
data.aws_iam_policy_document.omnibus-assume: Reading...
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...
data.aws_iam_policy_document.service-network-tester-permissions: Reading...
data.aws_iam_policy_document.gha-admin-tester-permissions: Reading...
data.aws_iam_policy_document.jumphost-tester-permissions: Reading...
data.aws_iam_policy_document.state-bucket-tester-permissions: Reading...
data.aws_iam_policy_document.website-pod-tester-permissions: Reading...
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]
data.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]
data.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=221812016]
data.aws_iam_policy_document.jumphost-tester-permissions: Read complete after 0s [id=1367345401]
data.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]
data.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]
aws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]
aws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]
aws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]
data.aws_iam_policy.read-only-access: Reading...
aws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]
aws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]
aws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]
module.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
aws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]
aws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...
data.aws_iam_policy.administrator-access: Reading...
aws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]
aws_iam_role.omnibus: Refreshing state... [id=omnibus]
aws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
module.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]
data.aws_iam_policy_document.pytest-permissions: Reading...
data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
module.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]
aws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]
aws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]
aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]
data.aws_iam_policy_document.gha-admin-tester-assume: Reading...
data.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]
data.aws_iam_policy_document.website-pod-tester-assume: Reading...
data.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]
data.aws_iam_policy_document.service-network-tester-assume: Reading...
data.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]
data.aws_iam_policy_document.state-bucket-tester-assume: Reading...
data.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...
data.aws_iam_policy_document.jumphost-tester-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]
data.aws_iam_policy_document.jumphost-tester-assume: Read complete after 0s [id=4147449685]
aws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]
aws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]
aws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]
aws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]
aws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]
aws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]
aws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]
aws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]
aws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]
aws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]
aws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]
aws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]
data.aws_iam_policy.read-only-access: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]
data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]
module.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
module.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
data.aws_iam_policy_document.omnibus-permissions: Reading...
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...
data.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]
aws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]
aws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]
module.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]
module.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.jumphost-tester-permissions will be created
  + resource "aws_iam_policy" "jumphost-tester-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "jumphost-tester-permissions"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # aws_iam_role.jumphost-tester will be created
  + resource "aws_iam_role" "jumphost-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                      + Sid       = "000"
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-jumphost:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = "010"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module terraform-aws-jumphost"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "jumphost-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.jumphost-tester will be created
  + resource "aws_iam_role_policy_attachment" "jumphost-tester" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "jumphost-tester"
    }

  # aws_iam_role_policy_attachment.jumphost-tester-admin-permissions will be created
  + resource "aws_iam_role_policy_attachment" "jumphost-tester-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "jumphost-tester"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: aws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]%0Aaws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...%0Adata.aws_iam_policy_document.omnibus-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-permissions: Reading...%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Reading...%0Adata.aws_iam_policy_document.jumphost-tester-permissions: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Reading...%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]%0Adata.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=221812016]%0Adata.aws_iam_policy_document.jumphost-tester-permissions: Read complete after 0s [id=1367345401]%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]%0Aaws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]%0Aaws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]%0Aaws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]%0Adata.aws_iam_policy.read-only-access: Reading...%0Aaws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]%0Aaws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]%0Aaws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Aaws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]%0Aaws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Aaws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]%0Aaws_iam_role.omnibus: Refreshing state... [id=omnibus]%0Aaws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]%0Adata.aws_iam_policy_document.pytest-permissions: Reading...%0Adata.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]%0Aaws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]%0Aaws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]%0Aaws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Reading...%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]%0Adata.aws_iam_policy_document.website-pod-tester-assume: Reading...%0Adata.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]%0Adata.aws_iam_policy_document.service-network-tester-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...%0Adata.aws_iam_policy_document.jumphost-tester-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]%0Adata.aws_iam_policy_document.jumphost-tester-assume: Read complete after 0s [id=4147449685]%0Aaws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]%0Aaws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]%0Aaws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]%0Aaws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]%0Aaws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]%0Aaws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]%0Aaws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]%0Aaws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]%0Aaws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]%0Aaws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]%0Aaws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]%0Aaws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]%0Adata.aws_iam_policy.read-only-access: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]%0Adata.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Adata.aws_iam_policy_document.omnibus-permissions: Reading...%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...%0Adata.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]%0Aaws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]%0Aaws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_policy.jumphost-tester-permissions will be created%0A  + resource "aws_iam_policy" "jumphost-tester-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "jumphost-tester-permissions"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "sts:GetCallerIdentity"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # aws_iam_role.jumphost-tester will be created%0A  + resource "aws_iam_role" "jumphost-tester" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::990466748045:user/aleks"%0A                        }%0A                      + Sid       = "000"%0A                    },%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          + StringLike   = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-jumphost:*"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                      + Sid       = "010"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to test module terraform-aws-jumphost"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "jumphost-tester"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.jumphost-tester will be created%0A  + resource "aws_iam_role_policy_attachment" "jumphost-tester" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "jumphost-tester"%0A    }%0A%0A  # aws_iam_role_policy_attachment.jumphost-tester-admin-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "jumphost-tester-admin-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "jumphost-tester"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC8xMTAwMTU5NC00ZDhjLTRhYjUtYjRhNy1jM2Q2MDlkN2ZhNWQvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5hd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXVlMjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtZWFzdC0xXVxuYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMyNDc5Mzg0ODVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMTAxNTA5MDcyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE4MTIwMTZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM2NzM0NTQwMV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDAyODUwNjU3Nl1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzgzNzAwNTE0MF1cbmF3c19pYW1fcm9sZS5paC10Zi1jaWNkLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWNpY2QtY29udHJvbF1cbmF3c19pYW1fcG9saWN5LlR3aW5EQlRlc3RSdW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L1R3aW5EQlRlc3RSdW5uZXJdXG5hd3NfaWFtX3BvbGljeS5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5yZWFkLW9ubHktYWNjZXNzOiBSZWFkaW5nLi4uXG5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdXG5hd3NfaWFtX3BvbGljeS5naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zXVxuYXdzX2lhbV9wb2xpY3kuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uc11cbm1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldC5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5hd3NfaWFtX3BvbGljeS53ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3dlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uc11cbmF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5hd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXV3MTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtd2VzdC0xXVxuYXdzX2lhbV9yb2xlLm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXNdXG5hd3NfaWFtX3VzZXIudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTMzODQxNzc1XVxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmNpX2NkX2luZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDY3OTAwODJPVTBQT1BXT0NQWjRdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXVxuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiX3Rlc3RfcnVubmVyLTIwMjMwNzAxMTgwMDMxMDg0NzAwMDAwMDAxXVxuYXdzX2lhbV9hY2Nlc3Nfa2V5LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQVVOS0FVRU4zMklXS1JTRVpdXG5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjAwNjU3MTczOV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMjc2NDk2MDQ1XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU4NTEwODc4OF1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MjM1ODk1MDldXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjY4Nzc1MjI3MV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE0NzQ0OTY4NV1cbmF3c19pYW1fcm9sZS5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyXVxuYXdzX2lhbV9yb2xlLndlYnNpdGUtcG9kLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyXVxuYXdzX2lhbV9yb2xlLnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXJdXG5hd3NfaWFtX3JvbGUuc3RhdGUtYnVja2V0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1Yl1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItc2Vybml2ZS1uZXR3b3JrLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXItMjAyMzA4MTMxNjI2MjIxNzI5MDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXItMjAyMzA4MTMxNjI2MjIyNjcyMDAwMDAwMDJdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2hhLWFkbWluLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlci0yMDIzMTAwOTE5MzQzNDY5NzEwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlci0yMDIzMTAwOTIwMzEyNDg2NjEwMDAwMDAwM11cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMwNzAzMTk0MjI1Mjg3NjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMxMDA5MjAzMTI0ODQyODAwMDAwMDAyXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXItMjAyMzEwMTUyMDMwMjQyNDQ0MDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXItMjAyMzEwMTUxOTUyMDE3MDE1MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTcwNTM5MTI4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViLTIwMjMwOTA4MDA0MTM4NDU5ODAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbl1cbmRhdGEuYXdzX2lhbV9wb2xpY3kucmVhZC1vbmx5LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvUmVhZE9ubHlBY2Nlc3NdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS0yMDIzMDgxMTE4MDYzNTA4NDAwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4tMjAyMzA3MDIxNTI3NDg2NDY0MDAwMDAwMDFdXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sLTIwMjMwNjMwMDMwODAzOTYxMjAwMDAwMDAxXVxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQyNzQwNjgyNDhdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTIzNTg3ODA2XVxuYXdzX2lhbV9wb2xpY3kub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvb21uaWJ1czIwMjMwNzI5MDQyNDMxOTk5MjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXMtMjAyMzA3MjkwNDI0MzIzMjM0MDAwMDAwMDJdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfYWNsLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZSxwdWJsaWMtcmVhZF1cbm1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgYXdzX2lhbV9wb2xpY3kuanVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImp1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IFwianVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zXCJcbiAgICAgICsgbmFtZV9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInN0czpHZXRDYWxsZXJJZGVudGl0eVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBhd3NfaWFtX3JvbGUuanVtcGhvc3QtdGVzdGVyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJqdW1waG9zdC10ZXN0ZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgQVdTID0gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnVzZXIvYWxla3NcIlxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgID0gXCIwMDBcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdFcXVhbHMgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nTGlrZSAgID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1qdW1waG9zdDoqXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBGZWRlcmF0ZWQgPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbVwiXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICAgPSBcIjAxMFwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gdGVzdCBtb2R1bGUgdGVycmFmb3JtLWF3cy1qdW1waG9zdFwiXG4gICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwianVtcGhvc3QtdGVzdGVyXCJcbiAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICB9XG4gICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuanVtcGhvc3QtdGVzdGVyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJqdW1waG9zdC10ZXN0ZXJcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImp1bXBob3N0LXRlc3RlclwiXG4gICAgfVxuXG4gICMgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0LXRlc3Rlci1hZG1pbi1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwianVtcGhvc3QtdGVzdGVyLWFkbWluLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXCJcbiAgICAgICsgcm9sZSAgICAgICA9IFwianVtcGhvc3QtdGVzdGVyXCJcbiAgICB9XG5cblBsYW46IDQgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBhd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXVlMjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtZWFzdC0xXSUwQWF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdWUxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy1lYXN0LTFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1paC1jaWNkLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI0NzkzODQ4NV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMTAxNTA5MDcyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4OTk2Mjk5NTJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTgxMjAxNl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM2NzM0NTQwMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwMjg1MDY1NzZdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODM3MDA1MTQwXSUwQWF3c19pYW1fcm9sZS5paC10Zi1jaWNkLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWNpY2QtY29udHJvbF0lMEFhd3NfaWFtX3BvbGljeS5Ud2luREJUZXN0UnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9Ud2luREJUZXN0UnVubmVyXSUwQWF3c19pYW1fcG9saWN5LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3NlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnNdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5yZWFkLW9ubHktYWNjZXNzOiBSZWFkaW5nLi4uJTBBYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXSUwQWF3c19pYW1fcG9saWN5LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2doYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnNdJTBBYXdzX2lhbV9wb2xpY3kuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uc10lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXQub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQWF3c19pYW1fcG9saWN5LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvd2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zXSUwQWF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFhd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXV3MTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtd2VzdC0xXSUwQWF3c19pYW1fcm9sZS5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1vbW5pYnVzXSUwQWF3c19pYW1fdXNlci50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzEzMzg0MTc3NV0lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmNpX2NkX2luZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDY3OTAwODJPVTBQT1BXT0NQWjRdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXSUwQWF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lci0yMDIzMDcwMTE4MDAzMTA4NDcwMDAwMDAwMV0lMEFhd3NfaWFtX2FjY2Vzc19rZXkudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BS0lBVU5LQVVFTjMySVdLUlNFWl0lMEFhd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDA2NTcxNzM5XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI3NjQ5NjA0NV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU4NTEwODc4OF0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTkyMzU4OTUwOV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjg3NzUyMjcxXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE0NzQ0OTY4NV0lMEFhd3NfaWFtX3JvbGUuZ2hhLWFkbWluLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUud2Vic2l0ZS1wb2QtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXJdJTBBYXdzX2lhbV9yb2xlLnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXJdJTBBYXdzX2lhbV9yb2xlLnN0YXRlLWJ1Y2tldC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItc2Vybml2ZS1uZXR3b3JrLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXItMjAyMzA4MTMxNjI2MjIxNzI5MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LndlYnNpdGUtcG9kLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyLTIwMjMwODEzMTYyNjIyMjY3MjAwMDAwMDAyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyLTIwMjMxMDA5MTkzNDM0Njk3MTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlci0yMDIzMTAwOTIwMzEyNDg2NjEwMDAwMDAwM10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlci0yMDIzMDcwMzE5NDIyNTI4NzYwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzEwMDkyMDMxMjQ4NDI4MDAwMDAwMDJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXItMjAyMzEwMTUyMDMwMjQyNDQ0MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdGF0ZS1idWNrZXQtdGVzdGVyLTIwMjMxMDE1MTk1MjAxNzAxNTAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTcwNTM5MTI4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1Yi0yMDIzMDkwODAwNDEzODQ1OTgwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kucmVhZC1vbmx5LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvUmVhZE9ubHlBY2Nlc3NdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktMjAyMzA4MTExODA2MzUwODQwMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4tMjAyMzA3MDIxNTI3NDg2NDY0MDAwMDAwMDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2wtMjAyMzA2MzAwMzA4MDM5NjEyMDAwMDAwMDFdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mjc0MDY4MjQ4XSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjM1ODc4MDZdJTBBYXdzX2lhbV9wb2xpY3kub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvb21uaWJ1czIwMjMwNzI5MDQyNDMxOTk5MjAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1vbW5pYnVzLTIwMjMwNzI5MDQyNDMyMzIzNDAwMDAwMDAyXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9hY2wub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLHB1YmxpYy1yZWFkXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBhd3NfaWFtX3BvbGljeS5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImp1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IFwianVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zXCIlMEEgICAgICArIG5hbWVfcHJlZml4ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzdHM6R2V0Q2FsbGVySWRlbnRpdHlcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBhd3NfaWFtX3JvbGUuanVtcGhvc3QtdGVzdGVyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwianVtcGhvc3QtdGVzdGVyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEFXUyA9IFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgID0gXCIwMDBcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBDb25kaXRpb24gPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0VxdWFscyA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdMaWtlICAgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1qdW1waG9zdDoqXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgID0gXCIwMTBcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSB0byB0ZXN0IG1vZHVsZSB0ZXJyYWZvcm0tYXdzLWp1bXBob3N0XCIlMEEgICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImp1bXBob3N0LXRlc3RlclwiJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0LXRlc3RlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImp1bXBob3N0LXRlc3RlclwiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwianVtcGhvc3QtdGVzdGVyXCIlMEEgICAgfSUwQSUwQSAgIyBhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuanVtcGhvc3QtdGVzdGVyLWFkbWluLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwianVtcGhvc3QtdGVzdGVyLWFkbWluLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NcIiUwQSAgICAgICsgcm9sZSAgICAgICA9IFwianVtcGhvc3QtdGVzdGVyXCIlMEEgICAgfSUwQSUwQVBsYW46IDQgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiA0LCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=```
</p></details>